{
  "HOME": {
    "GREETING": "Olá, meu nome é Leonardo",
    "TITLE_1": "Desenvolvedor Full-Stack",
    "TITLE_2": "Java and Node.js",
    "DESCRIPTION": "Sou um desenvolvedor Full-Stack apaixonado por criar soluções que não apenas atendam aos requisitos funcionais, mas também proporcionem desempenho excepcional e fortaleçam a confiança dos usuários através de experiências estáveis e seguras.",
    "RESUME_BUTTON": "Curriculo",
    "GITHUB_BUTTON": "GitHub",
    "PATH":"./assets/curriculo.html"
  },
  "NAVBAR": {
    "MAIN-LANGUAGE":"Português (BR)",
    "PORTUGUESE":"Português (BR)",
    "ENGLISH":"Inglês (US)",
    "HOME": "Home",
    "ABOUT": "Sobre",
    "PROJECTS": "Projetos",
    "CONTACTS": "Contatos"
  },
  "ABOUT": {
    "TITLE": "Sobre",
    "SUBTITLE": "Desenvolvedor Full-Stack",
    "TITLE_2": "Meu Valor",
    "DESCRIPTION_1": "Aos 20 anos, sou um desenvolvedor full-stack apaixonado por criar soluções robustas e escaláveis. Com experiência em Node.js, Spring Boot e TypeScript, desenvolvo APIs e sistemas que priorizam performance e segurança, aplicando conceitos de Domain-Driven Design (DDD) para criar arquiteturas bem estruturadas e alinhadas às necessidades do negócio.",
    "DESCRIPTION_2": "Também possuo conhecimentos em Angular e React, o que me permite ter uma visão completa do desenvolvimento full-stack e colaborar efetivamente com equipes front-end. Estou em busca de oportunidades que me permitam aplicar meus conhecimentos técnicos enquanto continuo evoluindo como desenvolvedor, contribuindo para projetos inovadores e impactantes."
  },
  "EDUCATION": {
    "TITLE": "Formação Acadêmica",
    "DEGREE_1": "Desenvolvimento de Software Multiplataforma",
    "DEGREE_2": "Técnico em Desenvolvimento de Sistemas",
    "DEGREE_3": "Inglês Intermediário",
    "SCHOOL_1": "FATEC - Faculdade de Tecnologia",
    "SCHOOL_2": "ETEC - Escola Técnica Estadual",
    "SCHOOL_3": "Icbeu",
    "DESCRIPTION_1": "Curso superior tecnológico focado em desenvolvimento de software, programação, banco de dados, engenharia de software e gestão de projetos.",
    "DESCRIPTION_2": "Formação técnica em programação, desenvolvimento web, banco de dados e redes de computadores.",
    "DESCRIPTION_3": "Cursei Inglês durante 3 anos da minha vida, atingindo um nivel Intermediário de Inglês e conseguindo me comunicar.",
    "STATUS_1": "Em andamento",
    "STATUS_2": "Concluído",
    "STATUS_3": "Certificado"
  },
  "PROJECTS": {
    "TITLE": "Projetos",
    "CARD_TITLE_1": "ErrorSquad Server",
    "CARD_TITLE_2": "Shop API",
    "CARD_TITLE_3": "Portfolio Pessoal",
    "CARD_TITLE_4": "Spring CRUD Docker",
    "DESCRIPTION_1": "API robusta desenvolvida com Node.js e TypeScript, implementando Domain-Driven Design (DDD) para gerenciamento de projetos. Utiliza PostgreSQL como banco de dados e oferece autenticação JWT para segurança.",
    "DESCRIPTION_2": "API REST em desenvolvimento para e-commerce desenvolvida em Spring Boot com Java. Implementa funcionalidades de catálogo de produtos, carrinho de compras, gerenciamento de usuários e processamento de pedidos.",
    "DESCRIPTION_3": "Portfolio pessoal desenvolvido com Angular e TypeScript, apresentando projetos, habilidades e experiências profissionais. Interface moderna e responsiva com animações suaves e design glassmorphism."
  },
  "CONTACTS": {
    "TITLE": "Contatos",
    "CARD_TITLE_1": "Email",
    "CARD_TITLE_2": "Telefone",
    "CARD_TITLE_3": "Linkedin",
    "CARD_TITLE_4": "GitHub",
    "DESCRIPTION_1": "Entre em contato por email para discussões sobre projetos, oportunidades profissionais ou colaborações.",
    "DESCRIPTION_2": "Disponível para conversas rápidas e alinhamentos sobre projetos. Prefira contato via WhatsApp.",
    "DESCRIPTION_3": "Conecte-se comigo no LinkedIn para acompanhar minha trajetória profissional e trocar experiências.",
    "DESCRIPTION_4": "Explore meus repositórios e projetos open source. Contribuições e colaborações são sempre bem-vindas!"
  },
  "FOOTER":{
    "TEXT":"© 2025 Leonardo da Silva Irineu. Todos os direitos reservados."
  },
  "SVG":{
    "LANGUAGE":"./assets/BR.svg"
  }
}